---
type: EnergyAnalysisOpening
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 18
tags: [revit-api, class]
---

# EnergyAnalysisOpening

`Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening` · Revit 2024 · 18 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAnalyticalSurface | 2012 | `public EnergyAnalysisSurface GetAnalyticalSurface ()` |
| Method | GetConstruction | 2024 | `public EnergyAnalysisConstruction GetConstruction ()` |
| Method | GetPolyloop | 2012 | `public Polyloop GetPolyloop ()` |
| Method | GetPolyloops | 2023 | `public IList < Polyloop > GetPolyloops ()` |
| Method | GetWindowType | 2024 | `public EnergyAnalysisWindowType GetWindowType ()` |
| Property | CADLinkUniqueId | 2012 | `public string CADLinkUniqueId { get ; }` |
| Property | CADObjectUniqueId | 2012 | `public string CADObjectUniqueId { get ; }` |
| Property | Corner | 2012 | `public XYZ Corner { get ; }` |
| Property | Height | 2012 | `public double Height { get ; }` |
| Property | OpeningId | 2012 | `public string OpeningId { get ; }` |
| Property | OpeningName | 2012 | `public string OpeningName { get ; }` |
| Property | OpeningType | 2012 | `public EnergyAnalysisOpeningType OpeningType { get ; }` |
| Property | OriginatingElementDescription | 2012 | `public string OriginatingElementDescription { get ; }` |
| Property | OriginatingElementId | 2024 | `public LinkElementId OriginatingElementId { get ; }` |
| Property | OriginatingElementName | 2024 | `public string OriginatingElementName { get ; }` |
| Property | Parameter | — | `` |
| Property | Type | 2012 | `public gbXMLOpeningType Type { get ; }` |
| Property | Width | 2012 | `public double Width { get ; }` |